#### AddNonContinuousRail Method

---

|  |
| --- |
| NonContinuousRailStructure Class   See Also |

Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public NonContinuousRailInfo AddNonContinuousRail( 	string name, 	double height, 	double offset ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddNonContinuousRail ( _ 	name As String, _ 	height As Double, _ 	offset As Double _ ) As NonContinuousRailInfo ``` |

| Visual C++ |
| --- |
| ``` public: NonContinuousRailInfo^ AddNonContinuousRail( 	String^ name,  	double height,  	double offset ) ``` |

#### Parameters

name
:   Type:  System String
     The name of the non-continuous rail.

height
:   Type:  System Double
     The height on which the non-continuous rail will be placed.

offset
:   Type:  System Double
     The offset of the non-continuous rail from a  Railing  center.

#### Return Value

Handle to the new Non-Continuous Rail.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The name is a duplicate of an existing non-continuous rail. -or- The height height is not valid for the non-continuous rail because it is greater than the height of the RailingType to which it belongs. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for height must be no more than 30000 feet in absolute value. -or- The given value for offset must be no more than 30000 feet in absolute value. |

# See Also

NonContinuousRailStructure Class

Autodesk.Revit.DB.Architecture Namespace